Revit 2027 API
TypeBinding(CategorySet) Constructor
Constructs a type binding with the set of categories passed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TypeBinding(
	CategorySet categories
)
Public Sub New (
	categories As CategorySet
)
public:
TypeBinding(
	CategorySet^ categories
)
new :
        categories : CategorySet -> TypeBinding
Parameters
categories CategorySet
Remarks
Categories can be set or changed at a later time by using the Categories property of this object.
See Also
Reference
TypeBinding Class
TypeBinding Overload
Autodesk.Revit.DB Namespace